Script started on Thu 17 Apr 2014 08:59:36 PM EDT
[1m[7m%[27m[1m[0m                                                                                  [0m[27m[24m[J[34m[35m~/workspace/prog-langs/dustsweeper[36m(Â±master) [00m[36mÂ»[00m [Kgghc Dustsweeper.h
[JDustsweeper.hi  Dustsweeper.hs[A[0m[27m[24m[46Cghc Dustsweeper.h[Ks
[J[00m[1m[7m%[27m[1m[0m                                                                                  [0m[27m[24m[J[34m[35m~/workspace/prog-langs/dustsweeper[36m(Â±master) [00m[36mÂ»[00m [K../Dustsweeper[1m [0m[0m 
[00mWrong number of args: 0 of 2.
Usage: Dustsweeper size numDusts
[1m[7m%[27m[1m[0m                                                                                  [0m[27m[24m[J[34m[35m~/workspace/prog-langs/dustsweeper[36m(Â±master) [00m[36mÂ»[00m [K./Dustsweeper 10 10
[00mâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘

Player 1> 0 0
1â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘

Player 2> 9 9
1â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘1

Player 1> 10 10
Invalid move: X must be within 0 and 9 but was 10.
Player 1> 10
Wrong number of inputs, needs X Y
Player 1> adsf 
Wrong number of inputs, needs X Y
Player 1> -10
Wrong number of inputs, needs X Y
Player 1> -0 10 -10
Invalid move: X must be within 0 and 9 but was -10.
Player 1> 0 0
Invalid move: (0,0). Rug is already explored.
Player 1> 5 5
1â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
1121212â–‘â–‘â–‘
      1â–‘â–‘â–‘
      1121
          
11211 111 
â–‘â–‘â–‘â–‘1 1â–‘1 
11211 2â–‘31
      1â–‘â–‘â–‘
      1â–‘â–‘1

Player 2> 2 2
Invalid move: (2,2). Rug is already explored.
Player 2> 3 3
Invalid move: (3,3). Rug is already explored.
Player 2> 0 9
1â–‘â–‘â–‘â–‘â–‘1   
1121212121
      1â–‘â–‘â–‘
      1121
          
11211 111 
â–‘â–‘â–‘â–‘1 1â–‘1 
11211 2â–‘31
      1â–‘â–‘â–‘
      1â–‘â–‘1

Player 1> 0 1
1Xâ–‘â–‘â–‘â–‘1   
1121212121
      1â–‘â–‘â–‘
      1121
          
11211 111 
â–‘â–‘â–‘â–‘1 1â–‘1 
11211 2â–‘31
      1â–‘â–‘â–‘
      1â–‘â–‘1

Player 2 Wins!
[1m[7m%[27m[1m[0m                                                                                  [0m[27m[24m[J[34m[35m~/workspace/prog-langs/dustsweeper[36m(Â±master) [00m[36mÂ»[00m [K

Script done on Thu 17 Apr 2014 09:00:37 PM EDT
